In [1]:
import pandas as pd

### séries
dic_alunos = {'M02': 'João',
             'M05': 'Maria',
             'M13': 'Bill',
             'M14': 'Cris',
             'M19': 'Jimi'}

alunos = pd.Series(dic_alunos)

# alunos[0]
# alunos['M02']
# alunos[['M02', 'M19', 'M13', 'M14']]
alunos[['M05', 'M14']]

M05    Maria
M14     Cris
dtype: object

In [2]:
s1 = pd.Series([2, 4, 6])
s2 = pd.Series([1, 3, 5])

# s1 * s2

import numpy as np

np.sqrt(s2)

0    1.000000
1    1.732051
2    2.236068
dtype: float64

In [3]:
# DataFrames

paises = pd.read_csv('https://raw.githubusercontent.com/celsocrivelaro/simple-datasets/main/paises.csv', index_col = 'sigla')
paises

              nome continente  extensao  corVerde
sigla
AR       Argentina    América      2780         0
BR          Brasil    América      8511         1
FR          França     Europa       644         0
IT          Itália     Europa       301         1
UK     Reino Unido     Europa       244         0

In [4]:
# paises.iloc[1]
paises.loc['BR']

nome           Brasil
continente    América
extensao         8511
corVerde            1
Name: BR, dtype: object

In [5]:
paises[((paises['extensao'] > 2000) & (paises['corVerde'] == 0))]

            nome continente  extensao  corVerde
sigla
AR     Argentina    América      2780         0

In [6]:
paises['Área(km²)'] = paises['extensao'] * 1_000_000
paises

              nome continente  extensao  corVerde   Área(km²)
sigla
AR       Argentina    América      2780         0  2780000000
BR          Brasil    América      8511         1  8511000000
FR          França     Europa       644         0   644000000
IT          Itália     Europa       301         1   301000000
UK     Reino Unido     Europa       244         0   244000000

In [7]:
def tem_verde(valor):
    if valor == 1:
        return 'Tem verde'
    else:
        return 'Não tem verde'
    
paises['tem_verde'] = paises['corVerde'].apply(tem_verde)
paises

              nome continente  extensao  corVerde   Área(km²)      tem_verde
sigla
AR       Argentina    América      2780         0  2780000000  Não tem verde
BR          Brasil    América      8511         1  8511000000      Tem verde
FR          França     Europa       644         0   644000000  Não tem verde
IT          Itália     Europa       301         1   301000000      Tem verde
UK     Reino Unido     Europa       244         0   244000000  Não tem verde

In [8]:
### Limpeza de dados

df = pd.DataFrame(dict(age=[5, 6, np.NaN],
                   born=[pd.NaT, pd.Timestamp('1939-05-27'),
                         pd.Timestamp('1940-04-25')],
                   name=['Alfred', 'Batman', ''],
                   toy=[None, 'Batmobile', 'Joker']))

df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [9]:
print(df.notna())

     age   born  name    toy
0   True  False  True  False
1   True   True  True   True
2  False   True  True   True

In [10]:
df.dropna()

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile

In [11]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})

df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e